Catalogs/Renault_СервисныеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_СервисныеАкции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяАкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставляетсяНаЗаказНаряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаВПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпенсацияВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАвторабот</Name>
			<Comment>Цены авторабот</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нормочас</Name>
					<Comment>Нормочас</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязанныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеРаботы</Name>
			<Comment>Связанные работы и детали для авторабот</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Renault_СервисныеАкции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицу("Работы");
	ЗаполнитьТаблицу("Запчасти");
	ДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) ПоместитьТаблицы() КонецПроцедуры

Процедура ДоступностьЭлементов()
	ВцеломНаЗаказ=?(Объект.ПредоставляетсяНаЗаказНаряд=0,Ложь,Истина);
	Элементы.грСкидкаНаЗаказНаряд.Доступность=ВцеломНаЗаказ;
	Элементы.грЗапчасти.Видимость=НЕ ВцеломНаЗаказ;
	Элементы.грРаботы.Видимость=НЕ ВцеломНаЗаказ;
КонецПроцедуры	

Процедура ЗаполнитьТаблицу(ТЧ,МассивСтрок=Неопределено)
	Запрос=Новый Запрос;
	Если МассивСтрок=Неопределено Тогда
		Запрос.УстановитьПараметр("Т",Объект[ТЧ].Выгрузить()); //загрузка из тч справочника в ТаблицуЗначений
	Иначе
		Запрос.УстановитьПараметр("Т",ЭтаФорма[ТЧ].Выгрузить(МассивСтрок)); //редактирование строки ТаблицыЗначений
	КонецЕсли;	
	Запрос.Текст="
	|Выбрать т.Элемент,т.СкидкаВПроцентах,т.СкидкаВРублях,т.КомпенсацияВРублях Поместить т Из &Т т
	|;
	|Выбрать
	|	Элемент,СкидкаВПроцентах,СкидкаВРублях,КомпенсацияВРублях,
	|	Максимум(Цены.Цена) Цена
	|Из т т Левое Соединение 
	|РегистрСведений.ЦеныАвторабот.СрезПоследних(,ТипЦен=Значение(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) Цены 
	|По т.Элемент=Цены.Авторабота
	|Сгруппировать По Элемент,СкидкаВПроцентах,СкидкаВРублях,КомпенсацияВРублях
	|";
	
	Если ТЧ="Запчасти" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"РегистрСведений.ЦеныАвторабот","РегистрСведений.Цены");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Авторабота","Номенклатура");
	КонецЕсли;	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если МассивСтрок=Неопределено Тогда
			Строка=ЭтаФорма[ТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(Строка,Выборка);
		Иначе
			Для Каждого Стр Из МассивСтрок Цикл
				Если Стр.Элемент=Выборка.Элемент Тогда
					Строка=Стр;
					Прервать
				КонецЕсли;	
			КонецЦикла;	
			Строка.Цена=Выборка.Цена;
		КонецЕсли;	
		
		//связанные автоработы и запчасти
		Результат=СвязанныеРаботы(Выборка.Элемент);
		ВыборкаСв=Результат.Выбрать();
		Пока ВыборкаСв.Следующий() Цикл Строка.СвязанныеРаботы=Строка.СвязанныеРаботы+?(Строка.СвязанныеРаботы="","",Символы.ПС)+ВыборкаСв.СвязаннаяРабота+" ("+ВыборкаСв.Количество+")" КонецЦикла;
		
		//картинка
		Если ТЧ="Работы" Тогда Строка.ЭтоКомплект=?(Результат.Пустой(),3,6) КонецЕсли;	
		
	КонецЦикла;	
КонецПроцедуры
Процедура ПоместитьТаблицы()
	Объект.Работы.Загрузить(Работы.Выгрузить());
	Объект.Запчасти.Загрузить(Запчасти.Выгрузить());
КонецПроцедуры

Функция СвязанныеРаботы(Работа)
	Запрос=Новый Запрос("Выбрать СвязаннаяРабота,Количество Из РегистрСведений.СвязанныеРаботы ГДЕ Авторабота=&Авторабота");
	Запрос.УстановитьПараметр("Авторабота",Работа);
	Возврат Запрос.Выполнить()
КонецФункции	

&НаКлиенте
Процедура ПредоставляетсяНаЗаказНарядПриИзменении(Элемент) ДоступностьЭлементов() КонецПроцедуры

&НаКлиенте
Процедура кнПодбор(Команда)
	ТЧ=СтрЗаменить(Команда.Имя,"кнПодбор","");
	ОткрытьФорму("Справочник.Renault_СервисныеАкции.Форма.ПодборЭлементовАкции",Новый Структура("ВидыНоменклатуры,ТЧ",ОтборПоВидуНоменклатуры(ТЧ),ТЧ),ЭтаФорма,УникальныйИдентификатор)
КонецПроцедуры

Функция ОтборПоВидуНоменклатуры(ТЧ)
	Если ТЧ="Работы" Тогда Возврат "" КонецЕсли;
	ЗначениеОтбора=РеквизитФормыВЗначение("Объект").Метаданные().ТабличныеЧасти[ТЧ].Реквизиты.Элемент.ПараметрыВыбора[0].Значение;
	Если ТипЗнч(ЗначениеОтбора)=Тип("ФиксированныйМассив") Тогда
		Массив=Новый Массив(ЗначениеОтбора);
	Иначе
		Массив=Новый Массив;
		Массив.Добавить(ЗначениеОтбора);
	КонецЕсли;
	Возврат Массив
КонецФункции	

&НаКлиенте
Процедура ДобавитьМассив(Массив,ТЧ) Экспорт //CALLBACK из формы подбора
	Если ТипЗнч(Массив)=Тип("Массив") Тогда
		Для Каждого Эл Из Массив Цикл ДобавитьСтроку(Эл,ТЧ) КонецЦикла;	
	Иначе ДобавитьСтроку(Массив,ТЧ) КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтроку(ЭлементПодбора,ТЧ)
	//если выбрана группа то добавим каждый элемент в иерархии с отбором по виду номенклатуры
	Если ЭлементПодбора.ЭтоГруппа Тогда
		
		Если ТЧ="Запчасти" Тогда
			Запрос=Новый Запрос("Выбрать Ссылка ИЗ Справочник.Номенклатура ГДЕ Ссылка В Иерархии(&Группа) И НЕ ЭтоГруппа И НЕ ПометкаУдаления И ВидНоменклатуры В(&ВидыНоменклатуры)");
			Запрос.УстановитьПараметр("ВидыНоменклатуры",ОтборПоВидуНоменклатуры(ТЧ));
		Иначе
			Запрос=Новый Запрос("Выбрать Ссылка ИЗ Справочник.Автоработы ГДЕ Ссылка В Иерархии(&Группа) И НЕ ЭтоГруппа И НЕ ПометкаУдаления");
		КонецЕсли;
		Запрос.УстановитьПараметр("Группа",ЭлементПодбора);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл ДобавитьСтроку(Выборка.Ссылка,ТЧ) КонецЦикла;	
		Возврат	
	КонецЕсли;
	
	//Если Объект[ТЧ].НайтиСтроки(Новый Структура("Элемент",ЭлементПодбора)).Количество()>0 Тогда Возврат КонецЕсли;
	//Стр=Объект[ТЧ].Добавить();
	
	Если ЭтаФорма[ТЧ].НайтиСтроки(Новый Структура("Элемент",ЭлементПодбора)).Количество()>0 Тогда Возврат КонецЕсли;

	//проверим чтобы подчиненные работы в комплекте не были добавлены отдельно
	Если НЕ ПроверкаЭлемента(ЭлементПодбора) Тогда Возврат КонецЕсли;	
	
	Стр=ЭтаФорма[ТЧ].Добавить();
	
	Стр.Элемент=ЭлементПодбора;
	//Стр.Цена=ЗаполнитьЦены(ТЧ,ЭлементПодбора);
	
	Массив=Новый Массив; Массив.Добавить(Стр);
	ЗаполнитьТаблицу(ТЧ,Массив);
	
КонецПроцедуры

Функция ПроверкаЭлемента(Элемент)
	
	//Элемент не должна быть в составляющих работ
	Для Каждого Стр Из Работы Цикл
		Выборка=СвязанныеРаботы(Стр.Элемент).Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.СвязаннаяРабота=Элемент Тогда
				Сообщить("Запчасть "+Элемент+" принадлежит комплекту "+Выборка.СвязаннаяРабота+", 
				|	который уже добавлен. Добавление не возможно",СтатусСообщения.Внимание);
				Возврат	Ложь
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	Если ТипЗнч(Элемент)=Тип("СправочникСсылка.Автоработы") Тогда
		//составляющие работы не должны быть в Запчастях и Работах
		
		Выборка=СвязанныеРаботы(Элемент).Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.СвязаннаяРабота)=Тип("СправочникСсылка.Номенклатура") Тогда
				ТЧ=Запчасти;
			ИначеЕсли ТипЗнч(Выборка.СвязаннаяРабота)=Тип("СправочникСсылка.Автоработы") Тогда
				ТЧ=Работы;
			КонецЕсли;	
			
			Если ТЧ.НайтиСтроки(Новый Структура("Элемент",Выборка.СвязаннаяРабота)).Количество()>0 Тогда 
				Сообщить("Комплект "+Элемент+" содержит элемент "+Выборка.СвязаннаяРабота+", 
				|	который уже добавлен. Добавление не возможно",СтатусСообщения.Внимание);
				Возврат	Ложь
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат Истина
КонецФункции	

//&НаКлиенте
//Процедура кнЗаполнитьЦены(Команда) ЗаполнитьЦены(СтрЗаменить(Команда.Имя,"кнЗаполнитьЦены","")) КонецПроцедуры
//Функция ЗаполнитьЦены(ТЧ,Элемент=Неопределено)
//	Запрос=Новый Запрос;
//	Запрос.УстановитьПараметр("ТЧ",РеквизитФормыВЗначение("Объект")[ТЧ]);
//	Если Элемент<>Неопределено Тогда Запрос.УстановитьПараметр("Элемент",Элемент) КонецЕсли;
//	Запрос.Текст="
//	|Выбрать ТЧ.Элемент,ТЧ.СкидкаВПроцентах,ТЧ.СкидкаВРублях,ТЧ.КомпенсацияВРублях Поместить ТЧ Из &ТЧ ТЧ
//	|;
//	|Выбрать
//	|   ТЧ.Элемент,ТЧ.СкидкаВПроцентах,ТЧ.СкидкаВРублях,ТЧ.КомпенсацияВРублях,
//	|	Максимум(Цены.Цена) Цена
//	|Из ТЧ ТЧ 
//	|Левое Соединение РегистрСведений.Цены.СрезПоследних(,ТипЦен=Значение(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) Цены
//	|По ТЧ.Элемент=Цены.Номенклатура "+?(Элемент=Неопределено,"","
//	|ГДЕ ТЧ.Элемент=&Элемент")+"
//	|Сгруппировать По ТЧ.Элемент,ТЧ.СкидкаВПроцентах,ТЧ.СкидкаВРублях,ТЧ.КомпенсацияВРублях
//	|";
//	
//	Если ТЧ="Работы" Тогда 
//		Запрос.Текст=СтрЗаменить(Запрос.Текст,"РегистрСведений.Цены","РегистрСведений.ЦеныАвторабот");
//		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Номенклатура","Авторабота");
//	КонецЕсли;
//	
//	Если Элемент=Неопределено Тогда	
//		Объект[ТЧ].Загрузить(Запрос.Выполнить().Выгрузить())
//	Иначе
//		Выборка=Запрос.Выполнить().Выбрать();
//		Выборка.Следующий();
//		Возврат Выборка.Цена
//	КонецЕсли;	
//КонецФункции

&НаКлиенте
Процедура кнЗаполнитьСкидки(Команда) 
	Парам=ОткрытьФормуМодально("Справочник.Renault_СервисныеАкции.Форма.ЗаполнениеСкидок",,ЭтаФорма);
	ТЧ=СтрЗаменить(Команда.Имя,"кнЗаполнитьСкидки","");
	Для Каждого Стр Из ЭтаФорма[ТЧ] Цикл
	//Для Каждого Стр Из Объект[ТЧ] Цикл
		Для Каждого Эл Из Парам Цикл
			//Если Эл.Значение=0 Тогда Продолжить КонецЕсли;
			Стр[Эл.Ключ]=Эл.Значение
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура кнЗагрузитьИзФайла(Команда) ОткрытьФорму("Справочник.Renault_СервисныеАкции.Форма.ЗагрузкаИзФайла",Новый Структура("Заполнять",Истина),ЭтаФорма) КонецПроцедуры
&НаКлиенте
Процедура ДобавитьЗапчасть(Структура) Экспорт 
	//ЗаполнитьЗначенияСвойств(Объект.Запчасти.Добавить(),Структура)
	Строка=Запчасти.Добавить();
	ЗаполнитьЗначенияСвойств(Строка,Структура);
	ЗаполнитьПоСтроке("Запчасти",Строка.ПолучитьИдентификатор());
КонецПроцедуры	

&НаКлиенте
Процедура кнОтчет(Команда)
	Массив=Новый Массив;
	Массив.Добавить(Объект.Ссылка);
	Парам=Новый Структура("СервисныеАкции",Массив);
	ОткрытьФорму("Отчет.Renault_ПредоставлениеСкидокСервиса.Форма",Парам,ЭтаФорма,УникальныйИдентификатор)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриИзменении(Элемент)
	ТабФормы=ПолучитьТаблицуФормы(Элемент);
	ЗаполнитьПоСтроке(ТабФормы.Имя,Элементы[ТабФормы.Имя].ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры
&НаКлиенте
Функция ПолучитьТаблицуФормы(Элемент) Если ТипЗнч(Элемент)=Тип("ТаблицаФормы") Тогда Возврат Элемент Иначе Возврат ПолучитьТаблицуФормы(Элемент.Родитель) КонецЕсли КонецФункции	
Процедура ЗаполнитьПоСтроке(ТЧ,СтрокаИД)
	Строка=ЭтаФорма[ТЧ].НайтиПоИдентификатору(СтрокаИД);
	Если Не ПроверкаЭлемента(Строка.Элемент) Тогда Строка.Элемент="" КонецЕсли;	
	
	Массив=Новый Массив; Массив.Добавить(Строка);
	ЗаполнитьТаблицу(ТЧ,Массив);
КонецПроцедуры
